In [1]:
import numpy as np 
import pandas as pd
import sklearn

In [9]:
db = pd.read_csv('hiring.csv')
db

  Experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [13]:
db['Experience'].fillna(0,inplace = True)

In [14]:
db

  Experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [16]:
db['test_score'].mean()

7.857142857142857

In [18]:
db['test_score'].fillna(db['test_score'].mean(),inplace = True)
db

  Experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [20]:
def convert_into_int(word):
    word_dict = {'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'eight':8,'nine':9,'ten':10,'eleven':11,'tweleve':12,'zero':0,0:0}
    return word_dict[word]

In [24]:
convert_into_int('zero')

0

In [39]:
db.loc[:,:]

  Experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [43]:
X = db.iloc[:,:3]

In [47]:
X['Experience'] = X['Experience'].apply(lambda x : convert_into_int(x))

In [50]:
y = db.iloc[:,-1]

In [51]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [52]:
regressor.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [55]:
regressor.score(X,y)

0.9639958361860578

In [57]:
regressor

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [58]:
import pickle

In [59]:
pickle.dump(regressor,open('model.pkl','wb'))

In [60]:
model = pickle.load(open('model.pkl','rb'))

In [65]:
model.predict([[3,7,10]])

array([61080.55179794])

In [63]:
db

  Experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000